In [46]:
#Importing dependencies
import pandas as pd
import os
import csv

In [13]:
#Files to load
donors_data_to_load = os.path.join("resources","donors2008.csv")

In [14]:
#Print the data frame
donors_data_df = pd.read_csv(donors_data_to_load)

In [15]:
donors_data_df

,LastName,FirstName,Employer,City,State,Zip,Amount,FIELD8
0,Aaron,Eugene,State Department,Dulles,VA,20189,500.0,NaN
1,Abadi,Barbara,Abadi & Co.,New York,NY,10021,200.0,NaN
2,Adamany,Anthony,Retired,Rockford,IL,61103,500.0,NaN
3,Adams,Lorraine,Self,New York,NY,10026,200.0,NaN
4,Adams,Marion,None,Exeter,NH,03833,100.0,NaN
...,...,...,...,...,...,...,...,...
1771,Zinczenko,David,Rodale,Allentown,PA,18102,500.0,NaN
1772,Zschiesche,Peter,NaN,San Diego,CA,92104,250.0,NaN
1773,Zweidinger,Ruth,NaN,Hillsborough,NC,27278,250.0,NaN
1774,Zwerdling,David,"Montg Cnty, Md",Silver Spring,MD,20910,35.0,NaN
1775,Zyskind,Jon,JDS Uniphase,Concord,MA,10742,25.0,NaN

In [17]:
# Determine the count of the donors_data_df
donors_data_df.count()

LastName     1776
FirstName    1776
Employer     1743
City         1776
State        1776
Zip          1776
Amount       1776
FIELD8          0
dtype: int64

In [18]:
# Use .isnull to determine if we have missing data in the data frame
donors_data_df.isnull()

      LastName  FirstName  Employer   City  State    Zip  Amount  FIELD8
0        False      False     False  False  False  False   False    True
1        False      False     False  False  False  False   False    True
2        False      False     False  False  False  False   False    True
3        False      False     False  False  False  False   False    True
4        False      False     False  False  False  False   False    True
...        ...        ...       ...    ...    ...    ...     ...     ...
1771     False      False     False  False  False  False   False    True
1772     False      False      True  False  False  False   False    True
1773     False      False      True  False  False  False   False    True
1774     False      False     False  False  False  False   False    True
1775     False      False     False  False  False  False   False    True

[1776 rows x 8 columns]

In [20]:
# Determine the data types for donors_data_df
donors_data_df.dtypes

LastName      object
FirstName     object
Employer      object
City          object
State         object
Zip           object
Amount       float64
FIELD8       float64
dtype: object

In [21]:
donors_data_df

,LastName,FirstName,Employer,City,State,Zip,Amount,FIELD8
0,Aaron,Eugene,State Department,Dulles,VA,20189,500.0,NaN
1,Abadi,Barbara,Abadi & Co.,New York,NY,10021,200.0,NaN
2,Adamany,Anthony,Retired,Rockford,IL,61103,500.0,NaN
3,Adams,Lorraine,Self,New York,NY,10026,200.0,NaN
4,Adams,Marion,None,Exeter,NH,03833,100.0,NaN
...,...,...,...,...,...,...,...,...
1771,Zinczenko,David,Rodale,Allentown,PA,18102,500.0,NaN
1772,Zschiesche,Peter,NaN,San Diego,CA,92104,250.0,NaN
1773,Zweidinger,Ruth,NaN,Hillsborough,NC,27278,250.0,NaN
1774,Zwerdling,David,"Montg Cnty, Md",Silver Spring,MD,20910,35.0,NaN
1775,Zyskind,Jon,JDS Uniphase,Concord,MA,10742,25.0,NaN

In [28]:
donors_data_count = donors_data_df["Amount"]
donors_data_count

0       500.0
1       200.0
2       500.0
3       200.0
4       100.0
        ...
1771    500.0
1772    250.0
1773    250.0
1774     35.0
1775     25.0
Name: Amount, Length: 1776, dtype: float64

In [45]:
def answer_five():
    return donors_data_df.groupby(["STNAME"],sort=False).sum()["COUNTY"].idxmax()

In [59]:
##### Third Question


import requests

url = 'http://vineoftheday.com/?order_by=rating'
response = requests.get(url)
#html = response.content
html = response.length

#soup = BeautifulSoup(html, "html.parser")

AttributeError: 'Response' object has no attribute 'length'